{
  "id": 168310,
  "title": "Request for a functionality to revise the GAs of TDS",
  "slug": "request-for-a-functionality-to-revise-the-gas-of-tds",
  "created_at": "2025-02-24T10:45:52.091Z",
  "last_posted_at": "2025-02-24T10:45:52.414Z",
  "posts_count": 1,
  "reply_count": 0,
  "like_count": 2,
  "views": 68,
  "category_id": 34,
  "url": "https://discourse.onlinedegree.iitm.ac.in/t/168310",
  "posts": [
    {
      "post_number": 1,
      "username": "22f3002813",
      "created_at": "2025-02-24T10:45:52.414Z",
      "updated_at": "2025-02-24T10:45:52.414Z",
      "raw_content": "",
      "cooked_content": "<p><a class=\"mention\" href=\"/u/carlton\">@carlton</a> <a class=\"mention\" href=\"/u/s.anand\">@s.anand</a><br>\nDear team,<br>\nGreetings of the day</p>\n<p>I am writing this to request for a functionality</p>\n<ol>\n<li>Practice the GAs again after their deadline has passed</li>\n<li>Either the answers can be posted or the same question answering and simultaneous evaluation interface can work just like it does before the deadline.</li>\n</ol>\n<p>How this is beneficial?</p>\n<ol>\n<li>As the GATE exam has now been completed,  we can now practice the questions we either left or could not do at that time</li>\n<li>Revision will help us ace the ROE, project and end term</li>\n</ol>\n<p>Overall this will increase the value of the already most practical and rewarding course of IIT BS i.e TDS.</p>\n<p>Looking forward to your guidance and kind consideration<br>\nRegards<br>\nAryan</p>",
      "cleaned_text": "@carlton @s.anand Dear team, Greetings of the day I am writing this to request for a functionality Practice the GAs again after their deadline has passed Either the answers can be posted or the same question answering and simultaneous evaluation interface can work just like it does before the deadline. How this is beneficial? As the GATE exam has now been completed, we can now practice the questions we either left or could not do at that time Revision will help us ace the ROE, project and end term Overall this will increase the value of the already most practical and rewarding course of IIT BS i.e TDS. Looking forward to your guidance and kind consideration Regards Aryan",
      "reply_count": 0,
      "like_count": 2,
      "trust_level": 0
    }
  ],
  "scraped_at": "2025-06-14T13:08:31.320905",
  "total_posts_scraped": 1
}