{
  "id": 168303,
  "title": "Project 2 and Week 6 assignment",
  "slug": "project-2-and-week-6-assignment",
  "created_at": "2025-02-24T08:43:31.005Z",
  "last_posted_at": "2025-02-24T09:16:21.851Z",
  "posts_count": 4,
  "reply_count": 2,
  "like_count": 6,
  "views": 93,
  "category_id": 34,
  "url": "https://discourse.onlinedegree.iitm.ac.in/t/168303",
  "posts": [
    {
      "post_number": 1,
      "username": "Yogesh1",
      "created_at": "2025-02-24T08:43:31.200Z",
      "updated_at": "2025-02-24T08:47:58.617Z",
      "raw_content": "",
      "cooked_content": "<p><a class=\"mention\" href=\"/u/carlton\">@carlton</a>  <a class=\"mention\" href=\"/u/s.anand\">@s.anand</a></p>\n<p>Release of Project 2 has been delayed by 3 days, and release of Assignment 6 has been delayed by 10 days.</p>\n<p>Could you please clarify if the submission dates will be changed accordingly? I am assuming it will have to be changed for Assignment 7 as well.</p>\n<p>Please let me know rough submission dates if possible so that I can plan accordingly (my schedule in the upcoming days is very hectic).</p>",
      "cleaned_text": "@carlton @s.anand Release of Project 2 has been delayed by 3 days, and release of Assignment 6 has been delayed by 10 days. Could you please clarify if the submission dates will be changed accordingly? I am assuming it will have to be changed for Assignment 7 as well. Please let me know rough submission dates if possible so that I can plan accordingly (my schedule in the upcoming days is very hectic).",
      "reply_count": 0,
      "like_count": 0,
      "trust_level": 1
    },
    {
      "post_number": 2,
      "username": "carlton",
      "created_at": "2025-02-24T08:55:51.942Z",
      "updated_at": "2025-02-24T08:55:51.942Z",
      "raw_content": "",
      "cooked_content": "<p><a class=\"mention\" href=\"/u/yogesh\">@Yogesh</a> GA6 will be released sometime this week. All GAs have a minimum 9 days for submissions.</p>\n<p>We do not have an ETA for Project 2 yet.</p>\n<p>Kind regards</p>",
      "cleaned_text": "@Yogesh GA6 will be released sometime this week. All GAs have a minimum 9 days for submissions. We do not have an ETA for Project 2 yet. Kind regards",
      "reply_count": 1,
      "like_count": 2,
      "trust_level": 3
    },
    {
      "post_number": 3,
      "username": "Yogesh1",
      "created_at": "2025-02-24T09:01:02.321Z",
      "updated_at": "2025-02-24T09:01:24.661Z",
      "raw_content": "",
      "cooked_content": "<p><a class=\"mention\" href=\"/u/carlton\">@carlton</a></p>\n<p>If possible, could you inform what weeks the project 2 would be based on (like Project 1 was based on week 3 content). Thanks in advance.</p>",
      "cleaned_text": "@carlton If possible, could you inform what weeks the project 2 would be based on (like Project 1 was based on week 3 content). Thanks in advance.",
      "reply_count": 1,
      "like_count": 1,
      "trust_level": 1
    },
    {
      "post_number": 4,
      "username": "carlton",
      "created_at": "2025-02-24T09:16:21.851Z",
      "updated_at": "2025-02-24T09:17:56.615Z",
      "raw_content": "",
      "cooked_content": "<p>Project 1 was based on Module 1 through 3.<br>\nProject 2 will encompass Module 4 through 6 (and possibly 7) but not to the exclusion of the prior modules. These are not set in stone and still is in the design/validation phase.</p>\n<p>We generally avoid calling it week 3 content etc. because all the content was released as modules at the beginning well before the term was started.</p>\n<p>The GAs are released as we complete validations on them. Each term the course assignments are updated to stay current with industry expectations. So they are not recycled like subjects that are static like maths, statistics and programming which have syllabi that have not changed in 10 years or more.</p>\n<p>We try to release GAs so that they match the cadence of the other subjects for the convenience of students wherever possible. But rarely do other subjects require constant revalidation for their GAs.</p>\n<p>Hence we have situations, even in past terms, where GAs and Projects get moved to allow for robust validations of the answers. In spite of this some errors do slip through due to the aggressive time schedule in a trimester system as opposed to a semester system.</p>\n<p>Hope that give you some insight into how TDS works.</p>\n<p>Thanks for bearing with us. TDS is perpetually a WIP.<br>\nKind regards</p>",
      "cleaned_text": "Project 1 was based on Module 1 through 3. Project 2 will encompass Module 4 through 6 (and possibly 7) but not to the exclusion of the prior modules. These are not set in stone and still is in the design/validation phase. We generally avoid calling it week 3 content etc. because all the content was released as modules at the beginning well before the term was started. The GAs are released as we complete validations on them. Each term the course assignments are updated to stay current with industry expectations. So they are not recycled like subjects that are static like maths, statistics and programming which have syllabi that have not changed in 10 years or more. We try to release GAs so that they match the cadence of the other subjects for the convenience of students wherever possible. But rarely do other subjects require constant revalidation for their GAs. Hence we have situations, even in past terms, where GAs and Projects get moved to allow for robust validations of the answers. In spite of this some errors do slip through due to the aggressive time schedule in a trimester system as opposed to a semester system. Hope that give you some insight into how TDS works. Thanks for bearing with us. TDS is perpetually a WIP. Kind regards",
      "reply_count": 0,
      "like_count": 3,
      "trust_level": 3
    }
  ],
  "scraped_at": "2025-06-14T13:08:34.098370",
  "total_posts_scraped": 4
}